nicolas-codemate/esp32-pixelcast/src/main.cpp
void loopWiFi();
void loopMQTT();
void loopDisplay();
void loopTime();
void loopApps();

void displayShowBoot();
void displayShowIP();
void displayShowTime();
void displayShowDate();
void displayShowApp(AppItem* app);
void displayShowWeatherClock(uint16_t appDuration = 10000);
void drawDropIcon(int16_t x, int16_t y, uint16_t color);
void drawSeparatorLine(int16_t y, uint16_t color);
void drawIconAtScale(CachedIcon* icon, int16_t x, int16_t y, uint8_t scale);
void displayClear();
void displaySetBrightness(uint8_t brightness);

int16_t calculateTextWidth(const char* text);
bool textNeedsScroll(const char* text, int16_t availableWidth);
void resetScrollState();

int pngDrawCallback(PNGDRAW *pDraw);
CachedIcon* loadIcon(const char* name);
CachedIcon* getIcon(const char* name);
int8_t findLRUSlot();
void drawIcon(CachedIcon* icon, int16_t x, int16_t y);
void initIconCache();
void invalidateCachedIcon(const char* name);
bool validatePngHeader(const uint8_t* data, size_t len);
bool validateGifHeader(const uint8_t* data, size_t len);
bool downloadLaMetricIcon(uint32_t iconId, const char* saveName);
void handleApiIconsList(AsyncWebServerRequest *request);
void handleApiIconsServe(AsyncWebServerRequest *request, const String& name);
void handleApiIconsDelete(AsyncWebServerRequest *request);

bool loadSettings();
bool saveSettings();
void initDefaultSettings();
void printTextWithSpecialChars(const char* text, int16_t x, int16_t y);
bool ensureDirectories();
bool loadApps();
bool saveApps();

int8_t appAdd(const char* id, const char* text, const char* icon,
              uint32_t textColor, uint16_t duration,
              uint32_t lifetime, int8_t priority, bool isSystem);
bool appRemove(const char* id);
bool appUpdate(const char* id, const char* text, const char* icon,
               uint32_t textColor);
int8_t appFind(const char* id);
void appCleanExpired();
AppItem* appGetNext();
AppItem* appGetCurrent();
void appSetZones(int8_t appIndex, JsonArray zonesArray);
void displayShowMultiZone(AppItem* app);
void displayShowZone(AppZone* zone, int16_t x, int16_t y, int16_t w, int16_t h);

// Tracker management
TrackerData* trackerFind(const char* name);
TrackerData* trackerAllocate(const char* name);
bool trackerRemove(const char* name);
void trackerInit();
void displayShowTracker(TrackerData* tracker);
void drawSparkline(const uint16_t* data, uint8_t count, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color);
void drawTrackerArrow(int16_t x, int16_t y, bool up, uint16_t color);
void formatTrackerValue(float value, char* buffer, size_t bufSize);
uint32_t parseColorValue(JsonVariant colorVar, uint32_t defaultColor);
void formatColorHex(uint32_t color, char* buffer, size_t bufSize);

// Notification management
void notifInit();
int8_t notifAdd(const char* id, const char* text, const char* icon,
                uint32_t textColor, uint32_t bgColor, uint16_t duration,
                bool hold, bool urgent, bool stack);
bool notifDismiss();
void notifClearAll();
NotificationItem* notifGetCurrent();
NotificationItem* notifGetNext();
bool notifIsExpired(NotificationItem* notif);
void displayShowNotification(NotificationItem* notif);
void resetNotifScrollState();

// Indicator management
void indicatorInit();
void indicatorSet(uint8_t index, IndicatorMode mode, uint32_t color,
                  uint16_t blinkInterval, uint16_t fadePeriod);
void indicatorOff(uint8_t index);
void drawIndicators();
bool indicatorNeedsRedraw();
void handleIndicatorApi(AsyncWebServerRequest *request, JsonVariant &json, uint8_t index);

void mqttCallback(char* topic, byte* payload, unsigned int length);
void mqttReconnect();
void mqttPublishStats();

void handleApiStats(AsyncWebServerRequest *request);
void handleApiSettings(AsyncWebServerRequest *request);
void handleApiApps(AsyncWebServerRequest *request);

void logMemory();

// ============================================================================
// Setup
// ============================================================================

void setup() {
    Serial.begin(115200);
    delay(100);

    Serial.println();
    Serial.println("========================================");
    Serial.println("   ESP32-PixelCast v" VERSION_STRING);
    Serial.println("   HUB75 LED Matrix Display Firmware");
    Serial.println("========================================");
    Serial.println();

    logMemory();

    Serial.println("[INIT] Setting up display...");
    setupDisplay();
    displayShowBoot();

    Serial.println("[INIT] Setting up filesystem...");
    setupFilesystem();

    // Initialize weather data as empty
    memset(&weatherData, 0, sizeof(weatherData));

    // Initialize tracker system
    trackerInit();

    // Initialize notification system
    notifInit();

    // Initialize indicator system (defaults set before loadSettings overrides)
    indicatorInit();

    Serial.println("[INIT] Loading settings...");
    if (!loadSettings()) {
        Serial.println("[INIT] Using default settings");
        initDefaultSettings();
    }
    displaySetBrightness(settings.brightness);

    Serial.println("[INIT] Setting up WiFi...");
    setupWiFi();

    if (wifiConnected) {
        Serial.println("[INIT] Setting up mDNS...");
        setupMDNS();

        Serial.println("[INIT] Setting up web server...");
        setupWebServer();

        Serial.println("[INIT] Setting up MQTT...");
        setupMQTT();

        Serial.println("[INIT] Setting up OTA...");
        ArduinoOTA.setHostname(MDNS_NAME);
        ArduinoOTA.onStart([]() {
            Serial.println("[OTA] Update starting...");
            dma_display->fillScreen(0);
            dma_display->setCursor(4, 28);
            dma_display->setTextColor(dma_display->color565(255, 165, 0));
            dma_display->print("OTA UPDATE");
        });
        ArduinoOTA.onEnd([]() {
            Serial.println("[OTA] Update complete!");
        });
        ArduinoOTA.onError([](ota_error_t error) {
            Serial.printf("[OTA] Error[%u]\n", error);
        });
        ArduinoOTA.begin();

        Serial.println("[INIT] Setting up NTP...");
        timeClient.setPoolServerName(settings.ntpServer);
        timeClient.setTimeOffset(settings.ntpOffset);
        timeClient.begin();

        displayShowIP();
        delay(2000);

        Serial.println("[INIT] Initializing icon cache...");
        initIconCache();

