nicolas-codemate/esp32-pixelcast/src/main.cpp
        Serial.println("[INIT] Setting up apps...");
        setupApps();

        // Load demo weather data for development (6 days to test 2-page pagination)
        Serial.println("[INIT] Loading demo weather data (6 days)...");
        strncpy(weatherData.currentIcon, "w_clear_day", sizeof(weatherData.currentIcon));
        weatherData.currentTemp = 18;
        weatherData.currentTempMin = 12;
        weatherData.currentTempMax = 24;
        weatherData.currentHumidity = 65;
        strncpy(weatherData.forecast[0].icon, "w_partly_day", sizeof(weatherData.forecast[0].icon));
        weatherData.forecast[0].tempMin = 12;
        weatherData.forecast[0].tempMax = 22;
        strncpy(weatherData.forecast[0].dayName, "LUN", sizeof(weatherData.forecast[0].dayName));
        strncpy(weatherData.forecast[1].icon, "w_rain", sizeof(weatherData.forecast[1].icon));
        weatherData.forecast[1].tempMin = 8;
        weatherData.forecast[1].tempMax = 15;
        strncpy(weatherData.forecast[1].dayName, "MAR", sizeof(weatherData.forecast[1].dayName));
        strncpy(weatherData.forecast[2].icon, "w_snow", sizeof(weatherData.forecast[2].icon));
        weatherData.forecast[2].tempMin = 0;
        weatherData.forecast[2].tempMax = 6;
        strncpy(weatherData.forecast[2].dayName, "MER", sizeof(weatherData.forecast[2].dayName));
        strncpy(weatherData.forecast[3].icon, "w_clear_day", sizeof(weatherData.forecast[3].icon));
        weatherData.forecast[3].tempMin = 14;
        weatherData.forecast[3].tempMax = 26;
        strncpy(weatherData.forecast[3].dayName, "JEU", sizeof(weatherData.forecast[3].dayName));
        strncpy(weatherData.forecast[4].icon, "w_cloudy", sizeof(weatherData.forecast[4].icon));
        weatherData.forecast[4].tempMin = 10;
        weatherData.forecast[4].tempMax = 19;
        strncpy(weatherData.forecast[4].dayName, "VEN", sizeof(weatherData.forecast[4].dayName));
        strncpy(weatherData.forecast[5].icon, "w_partly_day", sizeof(weatherData.forecast[5].icon));
        weatherData.forecast[5].tempMin = 15;
        weatherData.forecast[5].tempMax = 28;
        strncpy(weatherData.forecast[5].dayName, "SAM", sizeof(weatherData.forecast[5].dayName));
        weatherData.forecastCount = 6;
        weatherData.lastUpdate = millis();
        weatherData.valid = true;
    }

    logMemory();
    Serial.println("[INIT] Setup complete!");
    Serial.println();
}

// ============================================================================
// Main Loop
// ============================================================================

void loop() {
    // Handle pending reboot (allow response to be sent first)
    if (pendingReboot && (millis() - rebootRequestTime > 500)) {
        Serial.println("[SYSTEM] Rebooting...");
        ESP.restart();
    }

    ArduinoOTA.handle();
    loopWiFi();
    loopMQTT();
    loopTime();
    loopApps();
    loopDisplay();

    delay(LOOP_DELAY);
}

// ============================================================================
// Display Functions
// ============================================================================

void setupDisplay() {
    HUB75_I2S_CFG mxconfig(
        PANEL_WIDTH,
        PANEL_HEIGHT,
        PANEL_CHAIN
    );

    // Trinity board pin configuration
    mxconfig.gpio.r1 = R1_PIN;
    mxconfig.gpio.g1 = G1_PIN;
    mxconfig.gpio.b1 = B1_PIN;
    mxconfig.gpio.r2 = R2_PIN;
    mxconfig.gpio.g2 = G2_PIN;
    mxconfig.gpio.b2 = B2_PIN;
    mxconfig.gpio.a = A_PIN;
    mxconfig.gpio.b = B_PIN;
    mxconfig.gpio.c = C_PIN;
    mxconfig.gpio.d = D_PIN;
    mxconfig.gpio.e = E_PIN;  // GPIO 18 on Trinity for 64x64 panels
    mxconfig.gpio.lat = LAT_PIN;
    mxconfig.gpio.oe = OE_PIN;
    mxconfig.gpio.clk = CLK_PIN;

    mxconfig.clkphase = false;
    mxconfig.driver = HUB75_I2S_CFG::SHIFTREG;

    #if DOUBLE_BUFFER
        mxconfig.double_buff = true;
    #endif

    dma_display = new MatrixPanel_I2S_DMA(mxconfig);

    if (!dma_display->begin()) {
        Serial.println("[ERROR] Display init failed!");
        while (true) { delay(1000); }
    }

    dma_display->setBrightness8(currentBrightness);
    dma_display->setTextWrap(false);  // Prevent ghost characters on text scroll
    dma_display->clearScreen();

    Serial.printf("[DISPLAY] Initialized %dx%d panel (E_PIN=%d)\n", PANEL_WIDTH, PANEL_HEIGHT, E_PIN);
}

void displayShowBoot() {
    dma_display->clearScreen();
    dma_display->setTextColor(dma_display->color565(0, 150, 255));
    dma_display->setTextSize(1);
    dma_display->setCursor(4, 24);
    dma_display->print("PixelCast");
    dma_display->setCursor(4, 36);
    dma_display->setTextColor(dma_display->color565(100, 100, 100));
    dma_display->print("v" VERSION_STRING);

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowIP() {
    dma_display->clearScreen();

    // "WiFi OK" in default font, centered
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);
    dma_display->setTextColor(dma_display->color565(0, 255, 0));
    dma_display->setCursor(11, 12);
    dma_display->print("WiFi OK");

    // IP address in default font, split across 2 lines for readability
    // e.g. "192.168" on line 1, "1.100" on line 2
    String ip = WiFi.localIP().toString();
    dma_display->setTextColor(dma_display->color565(255, 255, 255));

    // Find the second dot to split the IP into 2 halves
    int firstDot = ip.indexOf('.');
    int secondDot = ip.indexOf('.', firstDot + 1);
    String line1 = ip.substring(0, secondDot);
    String line2 = ip.substring(secondDot + 1);

    // Line 1: first two octets (NULL font, 6px per char)
    int16_t line1Width = line1.length() * 6;
    int16_t line1X = (DISPLAY_WIDTH - line1Width) / 2;
    dma_display->setCursor(line1X, 28);
    dma_display->print(line1);

    // Line 2: last two octets
    int16_t line2Width = line2.length() * 6;
    int16_t line2X = (DISPLAY_WIDTH - line2Width) / 2;
    dma_display->setCursor(line2X, 40);
    dma_display->print(line2);

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif

