nicolas-codemate/esp32-pixelcast/src/main.cpp
    delay(3000);
}

void displayShowTime() {
    dma_display->clearScreen();

    // Get time
    int hours = timeClient.getHours();
    int minutes = timeClient.getMinutes();
    int seconds = timeClient.getSeconds();

    // Apply 12h format if configured
    if (!settings.clockFormat24h && hours > 12) {
        hours -= 12;
    }

    // Format time string
    char timeStr[9];
    if (settings.clockShowSeconds) {
        snprintf(timeStr, sizeof(timeStr), "%02d:%02d:%02d", hours, minutes, seconds);
    } else {
        snprintf(timeStr, sizeof(timeStr), "%02d:%02d", hours, minutes);
    }

    // Extract RGB from color
    uint8_t r = (settings.clockColor >> 16) & 0xFF;
    uint8_t g = (settings.clockColor >> 8) & 0xFF;
    uint8_t b = settings.clockColor & 0xFF;

    // Draw time centered
    dma_display->setTextColor(dma_display->color565(r, g, b));
    dma_display->setTextSize(1);

    // Center text based on format
    int textWidth = settings.clockShowSeconds ? 48 : 30;
    int xPos = (DISPLAY_WIDTH - textWidth) / 2;
    dma_display->setCursor(xPos, 28);
    dma_display->print(timeStr);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowDate() {
    dma_display->clearScreen();

    // Get date from NTP epoch
    unsigned long epochTime = timeClient.getEpochTime();
    struct tm* timeinfo = gmtime((time_t*)&epochTime);

    uint8_t day = timeinfo->tm_mday;
    uint8_t month = timeinfo->tm_mon + 1;
    uint16_t year = timeinfo->tm_year + 1900;

    // Format date string based on settings
    char dateStr[16];
    if (strcmp(settings.dateFormat, "MM/DD/YYYY") == 0) {
        snprintf(dateStr, sizeof(dateStr), "%02u/%02u/%04u", month, day, year);
    } else if (strcmp(settings.dateFormat, "YYYY-MM-DD") == 0) {
        snprintf(dateStr, sizeof(dateStr), "%04u-%02u-%02u", year, month, day);
    } else {
        // Default: DD/MM/YYYY
        snprintf(dateStr, sizeof(dateStr), "%02u/%02u/%04u", day, month, year);
    }

    // Extract RGB from color
    uint8_t r = (settings.dateColor >> 16) & 0xFF;
    uint8_t g = (settings.dateColor >> 8) & 0xFF;
    uint8_t b = settings.dateColor & 0xFF;

    // Draw date centered
    dma_display->setTextColor(dma_display->color565(r, g, b));
    dma_display->setTextSize(1);

    int textWidth = 60;
    int xPos = (DISPLAY_WIDTH - textWidth) / 2;
    dma_display->setCursor(xPos, 28);
    dma_display->print(dateStr);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// Draw icon at explicit scale (1 = native, 2 = upscale x2)
void drawIconAtScale(CachedIcon* icon, int16_t x, int16_t y, uint8_t scale) {
    if (!icon || !icon->valid || !icon->pixels) return;

    for (uint8_t py = 0; py < icon->height; py++) {
        for (uint8_t px = 0; px < icon->width; px++) {
            uint16_t pixel = icon->pixels[py * icon->width + px];
            if (pixel != 0) {
                if (scale == 2) {
                    int16_t dx = x + px * 2;
                    int16_t dy = y + py * 2;
                    dma_display->drawPixel(dx, dy, pixel);
                    dma_display->drawPixel(dx + 1, dy, pixel);
                    dma_display->drawPixel(dx, dy + 1, pixel);
                    dma_display->drawPixel(dx + 1, dy + 1, pixel);
                } else {
                    dma_display->drawPixel(x + px, y + py, pixel);
                }
            }
        }
    }
}

// Draw a small water drop icon (5px tall)
void drawDropIcon(int16_t x, int16_t y, uint16_t color) {
    //   .X.
    //   .X.
    //   XXX
    //   XXX
    //   .X.
    dma_display->drawPixel(x + 1, y,     color);
    dma_display->drawPixel(x + 1, y + 1, color);
    dma_display->drawPixel(x,     y + 2, color);
    dma_display->drawPixel(x + 1, y + 2, color);
    dma_display->drawPixel(x + 2, y + 2, color);
    dma_display->drawPixel(x,     y + 3, color);
    dma_display->drawPixel(x + 1, y + 3, color);
    dma_display->drawPixel(x + 2, y + 3, color);
    dma_display->drawPixel(x + 1, y + 4, color);
}

// Draw a thin horizontal separator line
void drawSeparatorLine(int16_t y, uint16_t color) {
    for (int16_t x = 4; x < DISPLAY_WIDTH - 4; x++) {
        dma_display->drawPixel(x, y, color);
    }
}

// ============================================================================
// Tracker Functions
// ============================================================================

TrackerData* trackerFind(const char* name) {
    for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
        if (trackers[i].valid && strcmp(trackers[i].name, name) == 0) {
            return &trackers[i];
        }
    }
    return nullptr;
}

TrackerData* trackerAllocate(const char* name) {
    // Check if already exists
    TrackerData* existing = trackerFind(name);
    if (existing) return existing;

    // Find first free slot
    for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
        if (!trackers[i].valid) {
            memset(&trackers[i], 0, sizeof(TrackerData));
            strlcpy(trackers[i].name, name, sizeof(trackers[i].name));
            trackers[i].symbolColor = 0xFFFFFF;    // Default white
            trackers[i].sparklineColor = 0x00D4FF;  // Default cyan
            trackers[i].valid = true;
            trackerCount++;
            return &trackers[i];
        }
    }
    return nullptr;
}

bool trackerRemove(const char* name) {
    TrackerData* tracker = trackerFind(name);
    if (!tracker) return false;

    tracker->valid = false;
    trackerCount--;

    // Remove corresponding app from rotation
    char appId[32];
    snprintf(appId, sizeof(appId), "%s%s", TRACKER_ID_PREFIX, name);
    appRemove(appId);

    Serial.printf("[TRACKER] Removed: %s\n", name);
    return true;
}

void trackerInit() {
    memset(trackers, 0, sizeof(trackers));
    trackerCount = 0;
    Serial.println("[TRACKER] Initialized");
}

// ============================================================================
// Notification Queue Management
// ============================================================================

void notifInit() {
    memset(notifications, 0, sizeof(notifications));
    notificationCount = 0;
    currentNotifIndex = -1;
    savedAppIndex = -1;
    memset(&notifScrollState, 0, sizeof(notifScrollState));
    Serial.println("[NOTIF] Initialized");
}

int8_t notifAdd(const char* id, const char* text, const char* icon,
                uint32_t textColor, uint32_t bgColor, uint16_t duration,
                bool hold, bool urgent, bool stack) {
    // Replace mode: clear all existing notifications first
    if (!stack) {
        notifClearAll();
    }

    // Find a free slot
    int8_t freeSlot = -1;
    for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
        if (!notifications[i].active) {
            freeSlot = i;
            break;
        }
    }

    if (freeSlot < 0) {
        Serial.println("[NOTIF] Queue full, dropping notification");
        return -1;
    }

    NotificationItem* notif = &notifications[freeSlot];
    memset(notif, 0, sizeof(NotificationItem));

    // Generate ID if not provided
    if (id && strlen(id) > 0) {
        strlcpy(notif->id, id, sizeof(notif->id));
    } else {
        snprintf(notif->id, sizeof(notif->id), "notif_%lu", millis());
    }

