nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Color helpers
    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimWhite = isStale ? dma_display->color565(60, 60, 60) : dma_display->color565(150, 150, 150);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t green = isStale ? dma_display->color565(0, 60, 0) : dma_display->color565(0, 200, 0);
    uint16_t red = isStale ? dma_display->color565(60, 0, 0) : dma_display->color565(200, 0, 0);

    uint8_t symR = (tracker->symbolColor >> 16) & 0xFF;
    uint8_t symG = (tracker->symbolColor >> 8) & 0xFF;
    uint8_t symB = tracker->symbolColor & 0xFF;
    uint16_t symbolColor565 = isStale
        ? dma_display->color565(symR / 4, symG / 4, symB / 4)
        : dma_display->color565(symR, symG, symB);

    uint8_t spkR = (tracker->sparklineColor >> 16) & 0xFF;
    uint8_t spkG = (tracker->sparklineColor >> 8) & 0xFF;
    uint8_t spkB = tracker->sparklineColor & 0xFF;
    uint16_t sparklineColor565 = isStale
        ? dma_display->color565(spkR / 4, spkG / 4, spkB / 4)
        : dma_display->color565(spkR, spkG, spkB);

    uint16_t valueColor = isStale ? dma_display->color565(60, 60, 60) : white;

    // --- Row 1: Icon + Symbol (y=0..11) ---
    CachedIcon* icon = nullptr;
    if (strlen(tracker->icon) > 0) {
        icon = getIcon(tracker->icon);
    }
    if (icon && icon->valid) {
        // Draw icon at native 8x8 at (2, 2)
        drawIconAtScale(icon, 2, 2, 1);
    }

    // Symbol text at (13, 4) in symbolColor
    dma_display->setFont(NULL);  // Default 5x7 font
    dma_display->setTextSize(1);
    dma_display->setTextColor(symbolColor565);
    dma_display->setCursor(13, 4);
    dma_display->print(tracker->symbol);

    // --- Row 2: Price value (y=14..22) ---
    char valueBuf[20];
    formatTrackerValue(tracker->currentValue, valueBuf, sizeof(valueBuf));
    dma_display->setTextColor(valueColor);
    dma_display->setCursor(2, 16);
    dma_display->print(valueBuf);

    // Currency symbol right-aligned in TomThumb
    if (strlen(tracker->currencySymbol) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t currWidth = strlen(tracker->currencySymbol) * 4;
        dma_display->setCursor(62 - currWidth, 22);
        dma_display->print(tracker->currencySymbol);
        dma_display->setFont(NULL);  // Reset to default
    }

    // --- Row 3: Arrow + Change % (y=25..33) ---
    bool isPositive = (tracker->changePercent >= 0.0f);
    uint16_t changeColor = isPositive ? green : red;

    drawTrackerArrow(2, 27, isPositive, changeColor);

    char changeBuf[16];
    snprintf(changeBuf, sizeof(changeBuf), "%s%.2f%%",
             isPositive ? "+" : "", tracker->changePercent);
    dma_display->setTextColor(changeColor);
    dma_display->setCursor(9, 27);
    dma_display->print(changeBuf);

    // --- Separator line (y=37) ---
    drawSeparatorLine(37, dimGray);

    // --- "24h" label right-aligned (y=39) ---
    dma_display->setFont(&TomThumb);
    dma_display->setTextColor(dimWhite);
    dma_display->setCursor(51, 43);
    dma_display->print("24h");
    dma_display->setFont(NULL);

    // --- Sparkline chart (y=40..53, x=2..61) ---
    if (tracker->sparklineCount >= 2) {
        drawSparkline(tracker->sparkline, tracker->sparklineCount,
                      2, 40, 60, 14, sparklineColor565);
    }

    // --- Separator line (y=55) ---
    drawSeparatorLine(55, dimGray);

    // --- Bottom text centered (y=57..63) ---
    if (strlen(tracker->bottomText) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t textWidth = strlen(tracker->bottomText) * 4;
        int16_t textX = (DISPLAY_WIDTH - textWidth) / 2;
        dma_display->setCursor(textX, 62);
        dma_display->print(tracker->bottomText);
        dma_display->setFont(NULL);
    }

    // --- Stale badge ---
    if (isStale) {
        uint16_t staleRed = dma_display->color565(200, 0, 0);
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(staleRed);
        dma_display->setCursor(42, 6);
        dma_display->print("STALE");
        dma_display->setFont(NULL);
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowWeatherClock(uint16_t appDuration) {
    // Fallback to time display if weather data is stale or missing
    unsigned long weatherAge = millis() - weatherData.lastUpdate;
    if (!weatherData.valid || weatherAge > 3600000) {
        displayShowTime();
        return;
    }

    // Use global weatherLastDrawnMinute / weatherLastUpdateDrawn
    // (reset by displayShowApp on app switch to force full redraw)

    int hours = timeClient.getHours();
    int minutes = timeClient.getMinutes();
    int seconds = timeClient.getSeconds();

    if (!settings.clockFormat24h && hours > 12) {
        hours -= 12;
    }

    bool needsFullRedraw = (weatherLastDrawnMinute != minutes) ||
                           (weatherLastUpdateDrawn != weatherData.lastUpdate);

    // Forecast pagination
    uint8_t forecastPageCount = max((uint8_t)1,
        (uint8_t)((weatherData.forecastCount + FORECAST_COLUMNS - 1) / FORECAST_COLUMNS));
    unsigned long pageInterval = (unsigned long)appDuration / forecastPageCount;

    bool pageChanged = false;
    if (forecastPageCount > 1) {
        unsigned long now = millis();
        if (now - lastForecastPageSwitch >= pageInterval) {
            forecastPage = (forecastPage + 1) % forecastPageCount;
            lastForecastPageSwitch = now;
            pageChanged = true;
        }
    }

    bool needsForecastRedraw = needsFullRedraw || pageChanged;

    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t cyan = dma_display->color565(0, 180, 255);
    uint16_t mintGreen = dma_display->color565(100, 255, 180);
    uint16_t gray = dma_display->color565(140, 140, 140);
    uint16_t coral = dma_display->color565(255, 140, 100);
    uint16_t coldBlue = dma_display->color565(80, 140, 255);
    uint16_t warmRed = dma_display->color565(255, 50, 30);
    uint16_t black = dma_display->color565(0, 0, 0);

