nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Draw text with special character handling
    printTextWithSpecialChars(app->text, xPos, textYPos);

    // Draw label below text if present (TomThumb font, dimmed color)
    if (app->label[0] != '\0') {
        dma_display->setFont(&TomThumb);
        uint8_t labelR = r / 2;
        uint8_t labelG = g / 2;
        uint8_t labelB = b / 2;
        dma_display->setTextColor(dma_display->color565(labelR, labelG, labelB));

        // TomThumb: ~4px per char, setCursor uses baseline (5px above baseline for uppercase)
        int16_t labelWidth = strlen(app->label) * 4;
        int16_t labelX = (DISPLAY_WIDTH - labelWidth) / 2;
        if (labelX < 2) labelX = 2;
        int16_t labelY = textYPos + 12;  // 7px font height + 5px to TomThumb baseline
        dma_display->setCursor(labelX, labelY);
        dma_display->print(app->label);

        // Restore default font
        dma_display->setFont(NULL);
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// ============================================================================
// Multi-Zone Display Rendering
// ============================================================================

// Render a single zone within its bounding box
void displayShowZone(AppZone* zone, int16_t x, int16_t y, int16_t w, int16_t h) {
    if (!zone) return;

    // Set text color
    uint8_t r = (zone->textColor >> 16) & 0xFF;
    uint8_t g = (zone->textColor >> 8) & 0xFF;
    uint8_t b = zone->textColor & 0xFF;
    dma_display->setTextColor(dma_display->color565(r, g, b));
    dma_display->setTextSize(1);

    // Try to load icon
    CachedIcon* icon = nullptr;
    if (strlen(zone->icon) > 0) {
        icon = getIcon(zone->icon);
    }

    bool isFullWidth = (w >= 48);

    bool hasLabel = (zone->label[0] != '\0');

    // Layout constants for label positioning
    // NULL font: setCursor = top of glyph, 7px tall -> occupies textY to textY+6
    // TomThumb: setCursor = baseline, ~5px above -> occupies labelY-4 to labelY
    // Gap of 2px between text bottom and label top: labelY - 4 = textY + 6 + 2 -> labelY = textY + 12

    if (isFullWidth) {
        // Full-width zone (64x31): icon left, text right
        int16_t textX = x + 2;
        // With label: center text+label block (7+2+5=14px) vertically
        // Without label: center text (7px) vertically
        int16_t textY = hasLabel ? y + (h - 14) / 2 : y + (h / 2) - 3;

        if (icon && icon->valid) {
            // Icon at left, vertically centered in zone
            uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
            uint8_t displayWidth = icon->width * scale;
            uint8_t displayHeight = icon->height * scale;
            int16_t iconX = x + 2;
            int16_t iconY = y + (h - displayHeight) / 2;
            drawIconAtScale(icon, iconX, iconY, scale);

            // Text starts after icon
            textX = iconX + displayWidth + 3;
        }

        // Truncate text to fit available width
        int16_t availableWidth = (x + w) - textX;
        int16_t maxChars = availableWidth / 6;  // 6px per char (5x7 font + 1px spacing)
        char truncatedText[32];
        strlcpy(truncatedText, zone->text, sizeof(truncatedText));
        if ((int16_t)strlen(truncatedText) > maxChars && maxChars > 0) {
            truncatedText[maxChars] = '\0';
        }

        printTextWithSpecialChars(truncatedText, textX, textY);

        // Draw label below text in TomThumb font with dimmed color
        if (hasLabel) {
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(dma_display->color565(r / 2, g / 2, b / 2));
            int16_t labelY = textY + 12;
            dma_display->setCursor(textX, labelY);
            dma_display->print(zone->label);
            // Restore default font and color
            dma_display->setFont(NULL);
            dma_display->setTextColor(dma_display->color565(r, g, b));
        }
    } else {
        // Half-width zone (31x31): icon top centered, text below
        bool hasIcon = (icon && icon->valid);

        // Adaptive font: use TomThumb for text when icon+label won't fit in default font
        // Icon 16px + default text 7px + gap 2px + label 5px = 30px (barely fits)
        // With TomThumb text: Icon 16px + text 5px + gap 1px + label 5px = 27px (comfortable)
        bool useCompactText = hasIcon && hasLabel;
        int16_t charWidth = useCompactText ? 4 : 6;

        int16_t textY;

        if (hasIcon) {
            uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
            uint8_t displayWidth = icon->width * scale;
            uint8_t displayHeight = icon->height * scale;
            int16_t iconX = x + (w - displayWidth) / 2;
            int16_t iconY = y + 2;
            drawIconAtScale(icon, iconX, iconY, scale);

            if (useCompactText) {
                // Both text and label in TomThumb below icon
                // TomThumb baseline positioning: glyphs ~5px above baseline
                // Icon bottom: iconY + displayHeight
                // Text baseline: icon bottom + 2px gap + 4px ascent = +6
                textY = iconY + displayHeight + 6;
            } else {
                // Default font below icon
                textY = iconY + displayHeight + 3;
            }
        } else {
            // No icon: center content vertically
            if (hasLabel) {
                // Default text (7px) + gap (2px) + label (5px) = 14px
                textY = y + (h - 14) / 2;
            } else {
                textY = y + h - 10;
            }
        }

        // Truncate text to fit zone width
        int16_t maxChars = (w - 2) / charWidth;
        char truncatedText[32];
        strlcpy(truncatedText, zone->text, sizeof(truncatedText));
        if ((int16_t)strlen(truncatedText) > maxChars && maxChars > 0) {
            truncatedText[maxChars] = '\0';
        }

        // Center text horizontally in zone
        int16_t textWidth = strlen(truncatedText) * charWidth;
        int16_t textX = x + (w - textWidth) / 2;
        if (textX < x + 1) textX = x + 1;

        if (useCompactText) {
            // Text in TomThumb (baseline positioning)
            dma_display->setFont(&TomThumb);
            dma_display->setCursor(textX, textY);
            dma_display->print(truncatedText);
        } else {
            // Text in default font (top-left positioning)
            printTextWithSpecialChars(truncatedText, textX, textY);
        }

        // Draw label below text in TomThumb with dimmed color
        if (hasLabel) {
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(dma_display->color565(r / 2, g / 2, b / 2));
            int16_t labelWidth = strlen(zone->label) * 4;
            int16_t labelX = x + (w - labelWidth) / 2;
            if (labelX < x + 1) labelX = x + 1;
            // Label baseline: 6px below text baseline (compact) or 12px below text top (default)
            int16_t labelY = useCompactText ? textY + 6 : textY + 12;
            dma_display->setCursor(labelX, labelY);
            dma_display->print(zone->label);
        }

