nicolas-codemate/esp32-pixelcast/src/main.cpp
        // Restore default font and color
        if (useCompactText || hasLabel) {
            dma_display->setFont(NULL);
            dma_display->setTextColor(dma_display->color565(r, g, b));
        }
    }
}

// Render multi-zone layout for an app
void displayShowMultiZone(AppItem* app) {
    if (!app || app->zoneCount < 2) return;

    dma_display->clearScreen();

    // Build array of all zones (zone 0 from main app fields, zones 1-3 from zones[])
    AppZone zone0;
    strlcpy(zone0.text, app->text, sizeof(zone0.text));
    strlcpy(zone0.icon, app->icon, sizeof(zone0.icon));
    strlcpy(zone0.label, app->label, sizeof(zone0.label));
    zone0.textColor = app->textColor;

    AppZone* allZones[MAX_ZONES] = { &zone0, nullptr, nullptr, nullptr };
    for (uint8_t i = 1; i < app->zoneCount && i < MAX_ZONES; i++) {
        allZones[i] = &app->zones[i - 1];
    }

    // Separator line color (dark gray)
    uint16_t separatorColor = dma_display->color565(40, 40, 40);

    switch (app->zoneCount) {
        case 2: {
            // Two horizontal rows: zone0 top (64x31), zone1 bottom (64x31)
            // Separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);

            displayShowZone(allZones[0], 0, 0, 64, 31);
            displayShowZone(allZones[1], 0, 33, 64, 31);
            break;
        }
        case 3: {
            // Top row full-width (zone0, 64x31), bottom row split (zone1 + zone2, 31x31 each)
            // Horizontal separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);
            // Vertical separator in bottom half at x=31
            dma_display->drawFastVLine(31, 33, 31, separatorColor);

            displayShowZone(allZones[0], 0, 0, 64, 31);
            displayShowZone(allZones[1], 0, 33, 31, 31);
            displayShowZone(allZones[2], 33, 33, 31, 31);
            break;
        }
        case 4: {
            // Four quadrants (31x31 each)
            // Horizontal separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);
            // Vertical separator at x=31
            dma_display->drawFastVLine(31, 0, 64, separatorColor);

            displayShowZone(allZones[0], 0, 0, 31, 31);
            displayShowZone(allZones[1], 33, 0, 31, 31);
            displayShowZone(allZones[2], 0, 33, 31, 31);
            displayShowZone(allZones[3], 33, 33, 31, 31);
            break;
        }
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayClear() {
    dma_display->clearScreen();
    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displaySetBrightness(uint8_t brightness) {
    currentBrightness = constrain(brightness, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    dma_display->setBrightness8(currentBrightness);
    Serial.printf("[DISPLAY] Brightness set to %d\n", currentBrightness);
}

int16_t calculateTextWidth(const char* text) {
    // Default 5x7 font with 1px spacing = 6 pixels per character
    return strlen(text) * 6;
}

bool textNeedsScroll(const char* text, int16_t availableWidth) {
    return calculateTextWidth(text) > availableWidth;
}

void resetScrollState() {
    appScrollState.scrollOffset = 0;
    appScrollState.lastScrollTime = millis();
    appScrollState.scrollPhase = 0;  // Start with pause
    appScrollState.needsScroll = false;
    appScrollState.textWidth = 0;
    appScrollState.availableWidth = DISPLAY_WIDTH - 4;  // 2px margin each side
}

void resetNotifScrollState() {
    notifScrollState.scrollOffset = 0;
    notifScrollState.lastScrollTime = millis();
    notifScrollState.scrollPhase = 0;
    notifScrollState.needsScroll = false;
    notifScrollState.textWidth = 0;
    notifScrollState.availableWidth = DISPLAY_WIDTH - 4;  // Full width minus 2px padding each side
}

// ============================================================================
// Notification Display
// ============================================================================

void displayShowNotification(NotificationItem* notif) {
    if (!notif || !notif->active) return;

    // Mark display timestamp on first render
    if (notif->displayedAt == 0) {
        notif->displayedAt = millis();
    }

    // Layout: horizontal separators with background color margins
    // [bg margin 4px] [separator line] [content: icon + text] [separator line] [bg margin 4px]
    const int16_t marginHeight = 6;
    const int16_t separatorTopY = marginHeight;                            // y=4
    const int16_t separatorBottomY = DISPLAY_HEIGHT - marginHeight - 1;    // y=59
    const int16_t contentY = separatorTopY + 2;                            // y=6
    const int16_t contentH = separatorBottomY - contentY - 1;             // 52
    const int16_t textPadding = 2;                                         // Horizontal text padding
    const int16_t textAreaWidth = DISPLAY_WIDTH - textPadding * 2;         // 60

    // Colors
    uint8_t tr = (notif->textColor >> 16) & 0xFF;
    uint8_t tg = (notif->textColor >> 8) & 0xFF;
    uint8_t tb = notif->textColor & 0xFF;
    uint16_t lineColor = dma_display->color565(tr, tg, tb);
    uint16_t black = dma_display->color565(0, 0, 0);

    uint16_t bgFill = black;
    if (notif->backgroundColor != 0) {
        uint8_t br = (notif->backgroundColor >> 16) & 0xFF;
        uint8_t bg = (notif->backgroundColor >> 8) & 0xFF;
        uint8_t bb = notif->backgroundColor & 0xFF;
        bgFill = dma_display->color565(br, bg, bb);
    }

    // === Build frame (no clearScreen to avoid DMA flicker) ===

    // 1. Background color margins (top and bottom strips)
    dma_display->fillRect(0, 0, DISPLAY_WIDTH, marginHeight, bgFill);
    dma_display->fillRect(0, DISPLAY_HEIGHT - marginHeight, DISPLAY_WIDTH, marginHeight, bgFill);

    // 2. Content area (black)
    dma_display->fillRect(0, marginHeight, DISPLAY_WIDTH, DISPLAY_HEIGHT - marginHeight * 2, black);

    // 3. Separator lines
    uint16_t separatorColor = (bgFill != black) ? bgFill : lineColor;
    dma_display->drawFastHLine(0, separatorTopY, DISPLAY_WIDTH, separatorColor);
    dma_display->drawFastHLine(0, separatorBottomY, DISPLAY_WIDTH, separatorColor);

    // 4. Load icon
    CachedIcon* icon = nullptr;
    uint8_t iconDisplayW = 0;
    uint8_t iconDisplayH = 0;
    if (strlen(notif->icon) > 0) {
        icon = getIcon(notif->icon);
        if (icon && icon->valid) {
            uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
            iconDisplayW = icon->width * scale;
            iconDisplayH = icon->height * scale;
        } else {
            icon = nullptr;
        }
    }

    // 5. Vertical centering of content (icon + text)
    const int16_t textHeight = 7;
    const int16_t iconTextGap = 4;
    int16_t totalContentH = textHeight;
    if (icon) {
        totalContentH = iconDisplayH + iconTextGap + textHeight;
    }
    int16_t contentStartY = contentY + (contentH - totalContentH) / 2;

    // 6. Draw icon centered horizontally
    int16_t textYPos;
    if (icon) {
        int16_t iconX = (DISPLAY_WIDTH - iconDisplayW) / 2;
        drawIcon(icon, iconX, contentStartY);
        textYPos = contentStartY + iconDisplayH + iconTextGap;
    } else {
        textYPos = contentStartY;
    }

    // 7. Draw text (full width, scrolls off-screen naturally - no clipping needed)
    dma_display->setTextColor(lineColor);
    dma_display->setTextSize(1);

    int16_t textWidth = calculateTextWidth(notif->text);
    bool needsScroll = textWidth > textAreaWidth;

    if (notifScrollState.textWidth != textWidth || notifScrollState.availableWidth != textAreaWidth) {
        notifScrollState.textWidth = textWidth;
        notifScrollState.availableWidth = textAreaWidth;
        notifScrollState.needsScroll = needsScroll;
        if (!needsScroll) {
            notifScrollState.scrollOffset = 0;
            notifScrollState.scrollPhase = 0;
        }
    }

    int16_t xPos;
    if (!needsScroll) {
        xPos = textPadding + (textAreaWidth - textWidth) / 2;
    } else {
        xPos = textPadding - notifScrollState.scrollOffset;
    }

    printTextWithSpecialChars(notif->text, xPos, textYPos);

