nicolas-codemate/esp32-pixelcast/src/main.cpp
    // POST /api/brightness - Set brightness (using AsyncCallbackJsonWebHandler)
    AsyncCallbackJsonWebHandler* brightnessHandler = new AsyncCallbackJsonWebHandler("/api/brightness",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /brightness handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            if (!doc["brightness"].isNull()) {
                uint8_t brightness = doc["brightness"].as<uint8_t>();
                displaySetBrightness(brightness);
                settings.brightness = brightness;
                saveSettings();
                Serial.printf("[API] Brightness set to %d\n", brightness);
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(400, "application/json", "{\"error\":\"Missing brightness\"}");
            }
        });
    webServer.addHandler(brightnessHandler);

    // POST /api/custom - Create/update custom app (using AsyncCallbackJsonWebHandler)
    AsyncCallbackJsonWebHandler* customHandler = new AsyncCallbackJsonWebHandler("/api/custom",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /custom handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Get app name from query param or JSON
            String name;
            if (request->hasParam("name")) {
                name = request->getParam("name")->value();
            } else if (!doc["name"].isNull()) {
                name = doc["name"].as<String>();
            } else {
                request->send(400, "application/json", "{\"error\":\"Missing app name\"}");
                return;
            }

            // Check for multi-zone format
            JsonArray zonesArray = doc["zones"].as<JsonArray>();
            bool isMultiZone = !zonesArray.isNull() && zonesArray.size() > 0;

            if (isMultiZone) {
                uint8_t zoneCount = zonesArray.size();
                if (zoneCount == 1 || zoneCount > MAX_ZONES) {
                    request->send(400, "application/json",
                        "{\"error\":\"zones array must have 2, 3, or 4 elements\"}");
                    return;
                }
            }

            // For multi-zone, zone 0 provides the main fields; for single-zone, use top-level fields
            const char* text = isMultiZone ? "" : (doc["text"] | "");
            const char* icon = isMultiZone ? "" : (doc["icon"] | "");
            const char* label = isMultiZone ? "" : (doc["label"] | "");
            uint32_t textColor = isMultiZone ? 0xFFFFFF : parseColorValue(doc["color"], 0xFFFFFF);

            uint16_t duration = doc["duration"] | settings.defaultDuration;
            uint32_t lifetime = doc["lifetime"] | 0;
            int8_t priority = doc["priority"] | 0;

            int8_t result = appAdd(name.c_str(), text, icon, textColor,
                                   duration, lifetime, priority, false);

            if (result >= 0) {
                // Copy label for single-zone
                if (!isMultiZone) {
                    strlcpy(apps[result].label, label, sizeof(apps[result].label));
                }
                // Apply multi-zone data if present
                if (isMultiZone) {
                    appSetZones(result, zonesArray);
                }
                Serial.printf("[API] Custom app '%s' created/updated\n", name.c_str());
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(500, "application/json", "{\"error\":\"Failed to add app\"}");
            }
        });
    webServer.addHandler(customHandler);

    // DELETE /api/custom - Delete custom app
    webServer.on("/api/custom", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        if (!request->hasParam("name")) {
            request->send(400, "application/json", "{\"error\":\"Missing app name\"}");
            return;
        }

        String name = request->getParam("name")->value();
        if (appRemove(name.c_str())) {
            request->send(200, "application/json", "{\"success\":true}");
        } else {
            request->send(404, "application/json", "{\"error\":\"App not found or is system app\"}");
        }
    });

    // POST /api/settings - Update settings (using AsyncCallbackJsonWebHandler)
    AsyncCallbackJsonWebHandler* settingsHandler = new AsyncCallbackJsonWebHandler("/api/settings",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /settings handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            // Update settings from JSON
            if (!doc["brightness"].isNull()) {
                settings.brightness = doc["brightness"].as<uint8_t>();
                displaySetBrightness(settings.brightness);
            }
            if (!doc["autoRotate"].isNull()) {
                settings.autoRotate = doc["autoRotate"].as<bool>();
                appRotationEnabled = settings.autoRotate;
            }
            if (!doc["defaultDuration"].isNull()) {
                settings.defaultDuration = doc["defaultDuration"].as<uint16_t>();
            }

            saveSettings();
            Serial.println("[API] Settings updated");
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(settingsHandler);

    // GET /api/weather - Return current weather data
    webServer.on("/api/weather", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;

        doc["valid"] = weatherData.valid;

        if (weatherData.valid) {
            unsigned long ageMs = millis() - weatherData.lastUpdate;
            doc["age"] = ageMs / 1000;
            doc["stale"] = (ageMs > 3600000);

            JsonObject current = doc["current"].to<JsonObject>();
            current["icon"] = weatherData.currentIcon;
            current["temp"] = weatherData.currentTemp;
            current["temp_min"] = weatherData.currentTempMin;
            current["temp_max"] = weatherData.currentTempMax;
            current["humidity"] = weatherData.currentHumidity;

