nicolas-codemate/esp32-pixelcast/src/main.cpp
            // Text is required
            if (doc["text"].isNull() || strlen(doc["text"] | "") == 0) {
                request->send(400, "application/json", "{\"error\":\"Missing text\"}");
                return;
            }

            const char* text = doc["text"] | "";
            const char* id = doc["id"] | "";
            const char* icon = doc["icon"] | "";
            uint32_t textColor = parseColorValue(doc["color"], 0xFFFFFF);
            uint32_t bgColor = parseColorValue(doc["background"], 0x000000);
            uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_NOTIF_DURATION;
            bool hold = doc["hold"] | false;
            bool urgent = doc["urgent"] | false;
            bool stack = doc["stack"] | true;

            int8_t slot = notifAdd(id, text, icon, textColor, bgColor,
                                   duration, hold, urgent, stack);

            if (slot < 0) {
                request->send(503, "application/json", "{\"error\":\"Notification queue full\"}");
                return;
            }

            // Return the assigned ID
            char response[128];
            snprintf(response, sizeof(response),
                     "{\"success\":true,\"id\":\"%s\"}", notifications[slot].id);
            request->send(200, "application/json", response);
        });
    webServer.addHandler(notifyHandler);

    // DELETE /api/indicator{1-3} - Turn off indicator
    webServer.on("/api/indicator1", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        indicatorOff(0); saveSettings();
        Serial.println("[API] Indicator 1 turned off (DELETE)");
        request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
    });
    webServer.on("/api/indicator2", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        indicatorOff(1); saveSettings();
        Serial.println("[API] Indicator 2 turned off (DELETE)");
        request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
    });
    webServer.on("/api/indicator3", HTTP_DELETE, [](AsyncWebServerRequest *request) {
        indicatorOff(2); saveSettings();
        Serial.println("[API] Indicator 3 turned off (DELETE)");
        request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
    });

    // POST /api/indicator{1-3} - Set corner indicators
    for (uint8_t idx = 0; idx < NUM_INDICATORS; idx++) {
        String path = "/api/indicator" + String(idx + 1);
        AsyncCallbackJsonWebHandler* indicatorHandler = new AsyncCallbackJsonWebHandler(
            path.c_str(),
            [idx](AsyncWebServerRequest *request, JsonVariant &json) {
                handleIndicatorApi(request, json, idx);
            });
        indicatorHandler->setMethod(HTTP_POST);
        webServer.addHandler(indicatorHandler);
    }
    Serial.println("[WEB] Indicator API endpoints registered");

    // POST /api/reboot - Reboot device (deferred to allow response to be sent)
    webServer.on("/api/reboot", HTTP_POST, [](AsyncWebServerRequest *request) {
        Serial.println("[API] Reboot requested");
        request->send(200, "application/json", "{\"success\":true,\"message\":\"Rebooting...\"}");
        pendingReboot = true;
        rebootRequestTime = millis();
    });

    // ========================================================================
    // Icon Management API
    // ========================================================================

    // GET /icons.html - Web interface for icon management
    webServer.on("/icons.html", HTTP_GET, [](AsyncWebServerRequest *request) {
        request->send(200, "text/html", ICONS_HTML);
    });

    // GET /api/icons/{name} - Serve icon file (must be before /api/icons to avoid prefix match)
    webServer.on("^\\/api\\/icons\\/([a-zA-Z0-9_-]+)$", HTTP_GET, [](AsyncWebServerRequest *request) {
        String iconName = request->pathArg(0);
        handleApiIconsServe(request, iconName);
    });

    // GET /api/icons - List all icons
    webServer.on("/api/icons", HTTP_GET, handleApiIconsList);

    // DELETE /api/icons?name={name} - Delete an icon
    webServer.on("/api/icons", HTTP_DELETE, handleApiIconsDelete);

    // POST /api/icons/lametric - Download icon from LaMetric
    // IMPORTANT: Must be registered BEFORE /api/icons POST to avoid path conflict
    AsyncCallbackJsonWebHandler* lametricHandler = new AsyncCallbackJsonWebHandler(
        "/api/icons/lametric",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

            uint32_t iconId = doc["id"] | 0;
            if (iconId == 0) {
                request->send(400, "application/json", "{\"error\":\"Missing or invalid icon id\"}");
                return;
            }

            // Use provided name or icon ID as name
            String name = doc["name"] | String(iconId);

            Serial.printf("[API] LaMetric download request: id=%d, name=%s\n", iconId, name.c_str());

            if (downloadLaMetricIcon(iconId, name.c_str())) {
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(500, "application/json", "{\"error\":\"Failed to download icon from LaMetric\"}");
            }
        });
    webServer.addHandler(lametricHandler);

    // POST /api/icons?name={name} - Upload icon (multipart/form-data)
    webServer.on("/api/icons", HTTP_POST,
        // Completion handler
        [](AsyncWebServerRequest *request) {
            if (uploadValid && uploadSize > 0) {
                Serial.printf("[ICON] Upload complete: %s (%d bytes)\n",
                              uploadIconName.c_str(), uploadSize);
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                // Clean up failed upload
                if (uploadIconName.length() > 0) {
                    String path = String(FS_ICONS_PATH) + "/" + uploadIconName + ".png";
                    if (LittleFS.exists(path)) {
                        LittleFS.remove(path);
                    }
                    path = String(FS_ICONS_PATH) + "/" + uploadIconName + ".gif";
                    if (LittleFS.exists(path)) {
                        LittleFS.remove(path);
                    }
                }
                request->send(400, "application/json", "{\"error\":\"Upload failed - invalid file format or size\"}");
            }
            // Reset upload state
            uploadIconName = "";
            uploadValid = false;
            uploadSize = 0;
        },
        // Chunk handler for file upload
        [](AsyncWebServerRequest *request, String filename, size_t index,
           uint8_t *data, size_t len, bool final) {

            if (index == 0) {
                // First chunk - initialize upload
                if (!request->hasParam("name")) {
                    Serial.println("[ICON] Upload missing name parameter");
                    uploadValid = false;
                    return;
                }

                uploadIconName = request->getParam("name")->value();
                uploadSize = 0;

