nicolas-codemate/esp32-pixelcast/src/main.cpp
                // Validate file header
                bool isPng = validatePngHeader(data, len);
                bool isGif = validateGifHeader(data, len);

                if (!isPng && !isGif) {
                    Serial.println("[ICON] Invalid file format (not PNG or GIF)");
                    uploadValid = false;
                    return;
                }

                // Determine extension based on format
                String ext = isPng ? ".png" : ".gif";
                String path = String(FS_ICONS_PATH) + "/" + uploadIconName + ext;

                uploadFile = LittleFS.open(path, "w");
                if (!uploadFile) {
                    Serial.printf("[ICON] Failed to create file: %s\n", path.c_str());
                    uploadValid = false;
                    return;
                }

                uploadValid = true;
                Serial.printf("[ICON] Upload started: %s\n", path.c_str());
            }

            // Write data chunk
            if (uploadValid && uploadFile) {
                // Check size limit
                if (uploadSize + len > MAX_ICON_SIZE) {
                    Serial.println("[ICON] Upload exceeds size limit");
                    uploadFile.close();
                    uploadValid = false;
                    return;
                }

                size_t written = uploadFile.write(data, len);
                uploadSize += written;
            }

            // Final chunk
            if (final && uploadFile) {
                uploadFile.close();
                if (uploadValid) {
                    // Invalidate cached icon
                    invalidateCachedIcon(uploadIconName.c_str());
                }
            }
        }
    );

    // Handle dynamic routes not caught by static handlers
    webServer.onNotFound([](AsyncWebServerRequest *request) {
        // Handle CORS preflight
        if (request->method() == HTTP_OPTIONS) {
            request->send(200);
            return;
        }

        String url = request->url();
        WebRequestMethodComposite method = request->method();

        // Handle DELETE routes (fallback if static handler misses due to HTTP_DELETE enum conflict)
        const WebRequestMethodComposite HTTP_DELETE_METHOD = 0b00000100;
        if (method == HTTP_DELETE_METHOD && url == "/api/icons") {
            handleApiIconsDelete(request);
            return;
        }
        if (method == HTTP_DELETE_METHOD && url == "/api/tracker") {
            if (!request->hasParam("name")) {
                request->send(400, "application/json", "{\"error\":\"Missing tracker name\"}");
                return;
            }
            String name = request->getParam("name")->value();
            if (trackerRemove(name.c_str())) {
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(404, "application/json", "{\"error\":\"Tracker not found\"}");
            }
            return;
        }
        if (method == HTTP_DELETE_METHOD && url.startsWith("/api/indicator")) {
            // Extract indicator number from URL (last char)
            char lastChar = url.charAt(url.length() - 1);
            uint8_t idx = lastChar - '1';  // '1'->0, '2'->1, '3'->2
            if (idx < NUM_INDICATORS) {
                indicatorOff(idx);
                saveSettings();
                Serial.printf("[API] Indicator %d turned off (DELETE)\n", idx + 1);
                request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
            } else {
                request->send(400, "application/json", "{\"error\":\"Invalid indicator number\"}");
            }
            return;
        }
        if (method == HTTP_DELETE_METHOD && url == "/api/custom") {
            if (!request->hasParam("name")) {
                request->send(400, "application/json", "{\"error\":\"Missing app name\"}");
                return;
            }
            String name = request->getParam("name")->value();
            if (appRemove(name.c_str())) {
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(404, "application/json", "{\"error\":\"App not found or is system app\"}");
            }
            return;
        }

        // Handle GET /api/icons/{name} for serving icon files (fallback)
        if (method == HTTP_GET && url.startsWith("/api/icons/")) {
            String iconName = url.substring(11);  // Remove "/api/icons/"
            // Sanitize: only allow alphanumeric, underscore, hyphen
            bool valid = true;
            for (size_t i = 0; i < iconName.length(); i++) {
                char c = iconName[i];
                if (!isalnum(c) && c != '_' && c != '-') {
                    valid = false;
                    break;
                }
            }
            if (valid && iconName.length() > 0) {
                handleApiIconsServe(request, iconName);
                return;
            }
        }

        request->send(404, "application/json", "{\"error\":\"Not found\"}");
    });

    webServer.begin();
    Serial.printf("[WEB] Server started on port %d\n", WEB_SERVER_PORT);
}

void handleApiStats(AsyncWebServerRequest *request) {
    JsonDocument doc;

    doc["version"] = VERSION_STRING;
    doc["uptime"] = millis() / 1000;
    doc["freeHeap"] = ESP.getFreeHeap();
    doc["maxAllocHeap"] = ESP.getMaxAllocHeap();
    doc["brightness"] = settings.brightness;
    doc["wifi"]["ssid"] = WiFi.SSID();
    doc["wifi"]["rssi"] = WiFi.RSSI();
    doc["wifi"]["ip"] = WiFi.localIP().toString();
    doc["display"]["width"] = DISPLAY_WIDTH;
    doc["display"]["height"] = DISPLAY_HEIGHT;
    doc["mqtt"]["connected"] = mqttConnected;
    doc["apps"]["count"] = appCount;
    doc["apps"]["current"] = currentAppIndex >= 0 ? apps[currentAppIndex].id : "";
    doc["apps"]["rotationEnabled"] = appRotationEnabled;
    doc["filesystem"]["ready"] = filesystemReady;
    if (filesystemReady) {
        doc["filesystem"]["total"] = LittleFS.totalBytes();
        doc["filesystem"]["used"] = LittleFS.usedBytes();
    }

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
}

void handleApiSettings(AsyncWebServerRequest *request) {
    JsonDocument doc;

    doc["brightness"] = settings.brightness;
    doc["autoRotate"] = settings.autoRotate;
    doc["defaultDuration"] = settings.defaultDuration;
    doc["display"]["width"] = DISPLAY_WIDTH;
    doc["display"]["height"] = DISPLAY_HEIGHT;
    doc["ntp"]["server"] = settings.ntpServer;
    doc["ntp"]["offset"] = settings.ntpOffset;
    doc["mqtt"]["enabled"] = settings.mqttEnabled;
    doc["mqtt"]["prefix"] = settings.mqttPrefix;

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
}

void handleApiApps(AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray appsArray = doc["apps"].to<JsonArray>();

