nicolas-codemate/esp32-pixelcast/src/main.cpp
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active) {
            JsonObject appObj = appsArray.add<JsonObject>();
            appObj["id"] = apps[i].id;
            appObj["text"] = apps[i].text;
            appObj["icon"] = apps[i].icon;
            if (apps[i].label[0] != '\0') {
                appObj["label"] = apps[i].label;
            }
            appObj["duration"] = apps[i].duration;
            appObj["lifetime"] = apps[i].lifetime;
            appObj["priority"] = apps[i].priority;
            appObj["isSystem"] = apps[i].isSystem;
            appObj["isCurrent"] = (currentAppIndex == i);

            // Color as hex string
            char colorHex[8];
            formatColorHex(apps[i].textColor, colorHex, sizeof(colorHex));
            appObj["color"] = colorHex;

            // Multi-zone data
            if (apps[i].zoneCount >= 2) {
                appObj["zoneCount"] = apps[i].zoneCount;
                JsonArray zonesArr = appObj["zones"].to<JsonArray>();
                // Zone 0 from main fields
                JsonObject z0 = zonesArr.add<JsonObject>();
                z0["text"] = apps[i].text;
                z0["icon"] = apps[i].icon;
                if (apps[i].label[0] != '\0') {
                    z0["label"] = apps[i].label;
                }
                char z0ColorHex[8];
                formatColorHex(apps[i].textColor, z0ColorHex, sizeof(z0ColorHex));
                z0["color"] = z0ColorHex;
                // Zones 1-N
                for (uint8_t z = 1; z < apps[i].zoneCount; z++) {
                    JsonObject zObj = zonesArr.add<JsonObject>();
                    zObj["text"] = apps[i].zones[z - 1].text;
                    zObj["icon"] = apps[i].zones[z - 1].icon;
                    if (apps[i].zones[z - 1].label[0] != '\0') {
                        zObj["label"] = apps[i].zones[z - 1].label;
                    }
                    char zColorHex[8];
                    formatColorHex(apps[i].zones[z - 1].textColor, zColorHex, sizeof(zColorHex));
                    zObj["color"] = zColorHex;
                }
            }
        }
    }

    doc["count"] = appCount;
    doc["currentIndex"] = currentAppIndex;
    doc["rotationEnabled"] = appRotationEnabled;

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
}

// ============================================================================
// MQTT Functions
// ============================================================================

void setupMQTT() {
    Serial.println("[MQTT] Not configured (TODO: implement config)");
}

void loopMQTT() {
    if (!wifiConnected) return;

    if (millis() - lastStatsPublish > MQTT_STATS_INTERVAL) {
        mqttPublishStats();
        lastStatsPublish = millis();
    }
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
    Serial.printf("[MQTT] Message on topic: %s\n", topic);

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, payload, length);

    if (error) {
        Serial.printf("[MQTT] JSON parse error: %s\n", error.c_str());
        return;
    }
}

void mqttPublishStats() {
    if (!mqttConnected) return;

    JsonDocument doc;
    doc["uptime"] = millis() / 1000;
    doc["freeHeap"] = ESP.getFreeHeap();
    doc["brightness"] = currentBrightness;
    doc["rssi"] = WiFi.RSSI();

    String payload;
    serializeJson(doc, payload);
}

// ============================================================================
// Filesystem Functions
// ============================================================================

void setupFilesystem() {
    if (!LittleFS.begin(true)) {
        Serial.println("[FS] LittleFS mount failed!");
        filesystemReady = false;
        return;
    }

    filesystemReady = true;
    Serial.printf("[FS] LittleFS mounted, total: %d bytes, used: %d bytes\n",
        LittleFS.totalBytes(), LittleFS.usedBytes());

    ensureDirectories();
}

bool ensureDirectories() {
    if (!filesystemReady) return false;

    const char* dirs[] = {FS_ICONS_PATH, FS_GIFS_PATH, FS_CONFIG_PATH};
    bool allOk = true;

    for (const char* dir : dirs) {
        if (!LittleFS.exists(dir)) {
            if (LittleFS.mkdir(dir)) {
                Serial.printf("[FS] Created directory: %s\n", dir);
            } else {
                Serial.printf("[FS] Failed to create directory: %s\n", dir);
                allOk = false;
            }
        }
    }

    return allOk;
}

void initDefaultSettings() {
    settings.brightness = DEFAULT_BRIGHTNESS;
    settings.autoRotate = true;
    settings.defaultDuration = DEFAULT_APP_DURATION;

    strlcpy(settings.ntpServer, NTP_SERVER, sizeof(settings.ntpServer));
    settings.ntpOffset = NTP_OFFSET;

    settings.clockEnabled = true;
    settings.clockFormat24h = true;
    settings.clockShowSeconds = true;
    settings.clockColor = 0xFFFFFF;

    settings.dateEnabled = true;
    strlcpy(settings.dateFormat, "DD/MM/YYYY", sizeof(settings.dateFormat));
    settings.dateColor = 0x6464FF;

    settings.mqttEnabled = false;
    settings.mqttServer[0] = '\0';
    settings.mqttPort = 1883;
    settings.mqttUser[0] = '\0';
    settings.mqttPassword[0] = '\0';
    strlcpy(settings.mqttPrefix, MQTT_PREFIX, sizeof(settings.mqttPrefix));
}

bool loadSettings() {
    if (!filesystemReady) {
        Serial.println("[SETTINGS] Filesystem not ready");
        return false;
    }

    File file = LittleFS.open(FS_CONFIG_FILE, "r");
    if (!file) {
        Serial.println("[SETTINGS] Config file not found");
        return false;
    }

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, file);
    file.close();

    if (error) {
        Serial.printf("[SETTINGS] JSON parse error: %s\n", error.c_str());
        return false;
    }

    // Display settings
    settings.brightness = doc["display"]["brightness"] | DEFAULT_BRIGHTNESS;
    settings.autoRotate = doc["display"]["autoRotate"] | true;
    settings.defaultDuration = doc["display"]["defaultDuration"] | DEFAULT_APP_DURATION;

