nicolas-codemate/esp32-pixelcast/src/main.cpp
    // NTP settings
    const char* ntpSrv = doc["ntp"]["server"] | NTP_SERVER;
    strlcpy(settings.ntpServer, ntpSrv, sizeof(settings.ntpServer));
    settings.ntpOffset = doc["ntp"]["offset"] | NTP_OFFSET;

    // Clock app settings
    settings.clockEnabled = doc["apps"]["clock"]["enabled"] | true;
    settings.clockFormat24h = doc["apps"]["clock"]["format24h"] | true;
    settings.clockShowSeconds = doc["apps"]["clock"]["showSeconds"] | true;

    JsonArray clockColorArr = doc["apps"]["clock"]["color"];
    if (clockColorArr.size() == 3) {
        settings.clockColor = ((uint32_t)clockColorArr[0].as<uint8_t>() << 16) |
                              ((uint32_t)clockColorArr[1].as<uint8_t>() << 8) |
                              (uint32_t)clockColorArr[2].as<uint8_t>();
    } else {
        settings.clockColor = 0xFFFFFF;
    }

    // Date app settings
    settings.dateEnabled = doc["apps"]["date"]["enabled"] | true;
    const char* dateFmt = doc["apps"]["date"]["format"] | "DD/MM/YYYY";
    strlcpy(settings.dateFormat, dateFmt, sizeof(settings.dateFormat));

    JsonArray dateColorArr = doc["apps"]["date"]["color"];
    if (dateColorArr.size() == 3) {
        settings.dateColor = ((uint32_t)dateColorArr[0].as<uint8_t>() << 16) |
                             ((uint32_t)dateColorArr[1].as<uint8_t>() << 8) |
                             (uint32_t)dateColorArr[2].as<uint8_t>();
    } else {
        settings.dateColor = 0x6464FF;
    }

    // MQTT settings
    settings.mqttEnabled = doc["mqtt"]["enabled"] | false;
    const char* mqttSrv = doc["mqtt"]["server"] | "";
    strlcpy(settings.mqttServer, mqttSrv, sizeof(settings.mqttServer));
    settings.mqttPort = doc["mqtt"]["port"] | 1883;
    const char* mqttUsr = doc["mqtt"]["user"] | "";
    strlcpy(settings.mqttUser, mqttUsr, sizeof(settings.mqttUser));
    const char* mqttPwd = doc["mqtt"]["password"] | "";
    strlcpy(settings.mqttPassword, mqttPwd, sizeof(settings.mqttPassword));
    const char* mqttPfx = doc["mqtt"]["prefix"] | MQTT_PREFIX;
    strlcpy(settings.mqttPrefix, mqttPfx, sizeof(settings.mqttPrefix));

    // Indicator settings
    for (int i = 0; i < NUM_INDICATORS; i++) {
        String key = String(i + 1);
        JsonObject indObj = doc["indicators"][key];
        if (indObj.isNull()) continue;

        const char* modeStr = indObj["mode"] | "off";
        IndicatorMode mode = INDICATOR_OFF;
        if (strcmp(modeStr, "solid") == 0) mode = INDICATOR_SOLID;
        else if (strcmp(modeStr, "blink") == 0) mode = INDICATOR_BLINK;
        else if (strcmp(modeStr, "fade") == 0) mode = INDICATOR_FADE;

        // Backward compatibility: old format had "enabled" boolean
        if (mode == INDICATOR_OFF && indObj["mode"].isNull() && indObj["enabled"].as<bool>()) {
            mode = INDICATOR_SOLID;
        }

        uint32_t color = indicators[i].color;  // Keep default if not provided
        JsonArray colorArr = indObj["color"];
        if (colorArr.size() == 3) {
            color = ((uint32_t)colorArr[0].as<uint8_t>() << 16) |
                    ((uint32_t)colorArr[1].as<uint8_t>() << 8) |
                    (uint32_t)colorArr[2].as<uint8_t>();
        }

        uint16_t blinkInterval = indObj["blinkInterval"] | (uint16_t)INDICATOR_BLINK_INTERVAL;
        uint16_t fadePeriod = indObj["fadePeriod"] | (uint16_t)INDICATOR_FADE_PERIOD;

        indicatorSet(i, mode, color, blinkInterval, fadePeriod);
    }

    Serial.println("[SETTINGS] Configuration loaded successfully");
    Serial.printf("[SETTINGS] Brightness: %d, AutoRotate: %s\n",
                  settings.brightness, settings.autoRotate ? "true" : "false");

    return true;
}

bool saveSettings() {
    if (!filesystemReady) {
        Serial.println("[SETTINGS] Filesystem not ready");
        return false;
    }

    JsonDocument doc;

    // Display settings
    doc["display"]["brightness"] = settings.brightness;
    doc["display"]["autoRotate"] = settings.autoRotate;
    doc["display"]["defaultDuration"] = settings.defaultDuration;
    doc["display"]["colorDepth"] = COLOR_DEPTH;
    doc["display"]["transition"] = "none";

    // WiFi settings
    doc["wifi"]["hostname"] = MDNS_NAME;

    // NTP settings
    doc["ntp"]["server"] = settings.ntpServer;
    doc["ntp"]["offset"] = settings.ntpOffset;
    doc["ntp"]["daylightOffset"] = 3600;

    // Clock app settings
    doc["apps"]["clock"]["enabled"] = settings.clockEnabled;
    doc["apps"]["clock"]["format24h"] = settings.clockFormat24h;
    doc["apps"]["clock"]["showSeconds"] = settings.clockShowSeconds;
    char clockColorHex[8];
    formatColorHex(settings.clockColor, clockColorHex, sizeof(clockColorHex));
    doc["apps"]["clock"]["color"] = clockColorHex;

    // Date app settings
    doc["apps"]["date"]["enabled"] = settings.dateEnabled;
    doc["apps"]["date"]["format"] = settings.dateFormat;
    char dateColorHex[8];
    formatColorHex(settings.dateColor, dateColorHex, sizeof(dateColorHex));
    doc["apps"]["date"]["color"] = dateColorHex;

    // MQTT settings
    doc["mqtt"]["enabled"] = settings.mqttEnabled;
    doc["mqtt"]["server"] = settings.mqttServer;
    doc["mqtt"]["port"] = settings.mqttPort;
    doc["mqtt"]["user"] = settings.mqttUser;
    doc["mqtt"]["password"] = settings.mqttPassword;
    doc["mqtt"]["prefix"] = settings.mqttPrefix;

    // Indicators
    for (int i = 0; i < NUM_INDICATORS; i++) {
        String key = String(i + 1);
        const char* modeStr = "off";
        switch (indicators[i].mode) {
            case INDICATOR_SOLID: modeStr = "solid"; break;
            case INDICATOR_BLINK: modeStr = "blink"; break;
            case INDICATOR_FADE:  modeStr = "fade";  break;
            default: break;
        }
        doc["indicators"][key]["mode"] = modeStr;
        char indicatorColorHex[8];
        formatColorHex(indicators[i].color, indicatorColorHex, sizeof(indicatorColorHex));
        doc["indicators"][key]["color"] = indicatorColorHex;
        doc["indicators"][key]["blinkInterval"] = indicators[i].blinkInterval;
        doc["indicators"][key]["fadePeriod"] = indicators[i].fadePeriod;
    }

    File file = LittleFS.open(FS_CONFIG_FILE, "w");
    if (!file) {
        Serial.println("[SETTINGS] Failed to open config file for writing");
        return false;
    }

    serializeJsonPretty(doc, file);
    file.close();

    Serial.println("[SETTINGS] Configuration saved successfully");
    return true;
}

bool loadApps() {
    if (!filesystemReady) {
        Serial.println("[APPS] Filesystem not ready, cannot load apps");
        return false;
    }

    File file = LittleFS.open(FS_APPS_FILE, "r");
    if (!file) {
        Serial.println("[APPS] Apps file not found, starting fresh");
        return false;
    }

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, file);
    file.close();

    if (error) {
        Serial.printf("[APPS] JSON parse error: %s\n", error.c_str());
        return false;
    }

