nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Create new app
    AppItem* app = &apps[emptySlot];
    strlcpy(app->id, id, sizeof(app->id));
    strlcpy(app->text, text, sizeof(app->text));
    if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
    else app->icon[0] = '\0';
    app->label[0] = '\0';  // Initialize label (caller will set if needed)
    app->textColor = textColor;
    app->duration = duration > 0 ? duration : settings.defaultDuration;
    app->lifetime = lifetime;
    app->createdAt = millis();
    app->priority = constrain(priority, -10, 10);
    app->active = true;
    app->isSystem = isSystem;
    // Initialize zone data (caller will set via appSetZones if needed)
    app->zoneCount = 0;
    memset(app->zones, 0, sizeof(app->zones));

    appCount++;
    Serial.printf("[APPS] Added app: %s (slot %d, total %d)\n", id, emptySlot, appCount);

    // Persist non-system apps
    if (!isSystem) {
        saveApps();
    }

    return emptySlot;
}

void appSetZones(int8_t appIndex, JsonArray zonesArray) {
    if (appIndex < 0 || appIndex >= MAX_APPS) return;

    AppItem* app = &apps[appIndex];
    uint8_t count = zonesArray.size();
    if (count < 2 || count > MAX_ZONES) return;

    app->zoneCount = count;

    // Zone 0 maps to the app's main text/icon/textColor/label fields
    JsonObject zone0 = zonesArray[0].as<JsonObject>();
    strlcpy(app->text, zone0["text"] | "", sizeof(app->text));
    strlcpy(app->icon, zone0["icon"] | "", sizeof(app->icon));
    strlcpy(app->label, zone0["label"] | "", sizeof(app->label));
    app->textColor = parseColorValue(zone0["color"], 0xFFFFFF);

    // Zones 1-3 map to app->zones[0..2]
    for (uint8_t i = 1; i < count && i < MAX_ZONES; i++) {
        JsonObject zoneObj = zonesArray[i].as<JsonObject>();
        strlcpy(app->zones[i - 1].text, zoneObj["text"] | "", sizeof(app->zones[0].text));
        strlcpy(app->zones[i - 1].icon, zoneObj["icon"] | "", sizeof(app->zones[0].icon));
        strlcpy(app->zones[i - 1].label, zoneObj["label"] | "", sizeof(app->zones[0].label));
        app->zones[i - 1].textColor = parseColorValue(zoneObj["color"], 0xFFFFFF);
    }

    Serial.printf("[APPS] Set %d zones for app: %s\n", count, app->id);

    // Persist non-system apps
    if (!app->isSystem) {
        saveApps();
    }
}

bool appRemove(const char* id) {
    int8_t index = appFind(id);
    if (index < 0) return false;

    AppItem* app = &apps[index];
    if (app->isSystem) {
        Serial.printf("[APPS] Cannot remove system app: %s\n", id);
        return false;
    }

    app->active = false;
    appCount--;

    // If removing current app, move to next
    if (currentAppIndex == index) {
        currentAppIndex = -1;
    }

    Serial.printf("[APPS] Removed app: %s\n", id);

    // Persist the removal
    saveApps();

    return true;
}

bool appUpdate(const char* id, const char* text, const char* icon,
               uint32_t textColor) {
    int8_t index = appFind(id);
    if (index < 0) return false;

    AppItem* app = &apps[index];
    if (text) strlcpy(app->text, text, sizeof(app->text));
    if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
    if (textColor != 0) app->textColor = textColor;
    app->createdAt = millis();

    Serial.printf("[APPS] Updated app: %s\n", id);
    return true;
}

int8_t appFind(const char* id) {
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active && strcmp(apps[i].id, id) == 0) {
            return i;
        }
    }
    return -1;
}

void appCleanExpired() {
    unsigned long now = millis();
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active && apps[i].lifetime > 0) {
            if (now - apps[i].createdAt > apps[i].lifetime) {
                Serial.printf("[APPS] App expired: %s\n", apps[i].id);
                apps[i].active = false;
                appCount--;
                if (currentAppIndex == i) {
                    currentAppIndex = -1;
                }
            }
        }
    }
}

AppItem* appGetNext() {
    if (appCount == 0) return nullptr;

    // Clean expired apps first
    appCleanExpired();
    if (appCount == 0) return nullptr;

    // Simple round-robin: find next active app after current
    int8_t startIndex = (currentAppIndex + 1) % MAX_APPS;

    for (uint8_t i = 0; i < MAX_APPS; i++) {
        int8_t idx = (startIndex + i) % MAX_APPS;
        if (apps[idx].active) {
            currentAppIndex = idx;
            return &apps[idx];
        }
    }

    return nullptr;
}

AppItem* appGetCurrent() {
    if (currentAppIndex >= 0 && currentAppIndex < MAX_APPS && apps[currentAppIndex].active) {
        return &apps[currentAppIndex];
    }
    return nullptr;
}

void loopApps() {
    if (!wifiConnected) return;

    // ---- Notification priority check (before app rotation) ----
    unsigned long now = millis();

    NotificationItem* currentNotif = notifGetCurrent();

    // Check if current notification has expired
    if (currentNotif && notifIsExpired(currentNotif)) {
        notifDismiss();
        resetNotifScrollState();
        currentNotif = notifGetNext();  // Try next in queue
        if (currentNotif) {
            resetNotifScrollState();
            // Draw twice to flush both DMA buffers
            displayShowNotification(currentNotif);
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
    }

    // If no current notification, check if new ones are queued
    if (!notifGetCurrent()) {
        currentNotif = notifGetNext();
        if (currentNotif) {
            // Save current app index to restore later (first time only)
            if (savedAppIndex < 0) {
                savedAppIndex = currentAppIndex;
            }
            resetNotifScrollState();
            // Draw twice to flush both DMA buffers (prevents weather ghosting)
            displayShowNotification(currentNotif);
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
    }

    // If a notification is active, skip app rotation
    if (notifGetCurrent()) {
        return;
    }

    // Just finished all notifications: restore app rotation
    if (savedAppIndex >= 0) {
        currentAppIndex = savedAppIndex;
        savedAppIndex = -1;
        lastAppSwitch = now;
        resetScrollState();
        // Reset weather clock cache to force full redraw (not just seconds update)
        weatherLastDrawnMinute = -1;
        weatherLastUpdateDrawn = 0;
        Serial.println("[NOTIF] All dismissed, resuming app rotation");
        // Clear both DMA buffers to remove any notification pixel remnants,
        // then force immediate app redraw on both buffers
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        AppItem* restored = appGetCurrent();
        if (restored) {
            displayShowApp(restored);
            displayShowApp(restored);
            lastDisplayUpdate = now;
        }
    }

    // ---- Normal app rotation ----
    if (appCount == 0) return;

    AppItem* current = appGetCurrent();

    if (current == nullptr) {
        // No current app, get first one
        current = appGetNext();
        if (current) {
            lastAppSwitch = now;
            resetScrollState();
            // Force immediate redraw
            displayShowApp(current);
            lastDisplayUpdate = now;
        }
        return;
    }

